# Gradient Boosting Algorithm

In [1]:
# All the required Libraries to be imported.
import numpy as np
import pandas as pd
from sklearn.ensemble import GradientBoostingRegressor
from sklearn import metrics

In [2]:
# Creating a dataframe
exp=[3,3,3,5,5,5,6,6,6]
deg=['B-tech','B.com','PHD','B-tech','B.com','PHD','B-tech','B.com','PHD']
sal=[30,20,40,60,50,70,76,50,90]
title=['Experience','Degree','Salary(in K)']
value=[exp,deg,sal]
res1=list(zip(title,value))
result1=dict(res1)
df2=pd.DataFrame(result1)
df2

   Experience  Degree  Salary(in K)
0           3  B-tech            30
1           3   B.com            20
2           3     PHD            40
3           5  B-tech            60
4           5   B.com            50
5           5     PHD            70
6           6  B-tech            76
7           6   B.com            50
8           6     PHD            90

In [3]:
# Displaying all the unique elements in Degree Column.
df2['Degree'].unique()

array(['B-tech', 'B.com', 'PHD'], dtype=object)

In [4]:
# Encoding using Dictionary
degree={
    'B.com':0,
    'B-tech':1,
    'PHD':2,
    'B-com':3,
}
df2=df2.replace({'Degree':degree})

In [5]:
df2

   Experience  Degree  Salary(in K)
0           3       1            30
1           3       0            20
2           3       2            40
3           5       1            60
4           5       0            50
5           5       2            70
6           6       1            76
7           6       0            50
8           6       2            90

In [6]:
# Assigning Salary Column as output and remaining columns as input
X=df2.drop('Salary(in K)', axis=1)  
Y=df2['Salary(in K)']

In [7]:
X

   Experience  Degree
0           3       1
1           3       0
2           3       2
3           5       1
4           5       0
5           5       2
6           6       1
7           6       0
8           6       2

In [8]:
Y

0    30
1    20
2    40
3    60
4    50
5    70
6    76
7    50
8    90
Name: Salary(in K), dtype: int64

In [9]:
# Creating an object regress
regress=GradientBoostingRegressor()
regress.fit(X,Y)

GradientBoostingRegressor()

In [10]:
errors=[metrics.mean_squared_error(Y,y_pred) for y_pred in regress.staged_predict(X)]
best_n_estimators=np.argmin(errors)

In [11]:
best_regress=GradientBoostingRegressor()
best_regress.fit(X,Y)

GradientBoostingRegressor()

In [12]:
# Error Metrics
y_pred=best_regress.predict(X)
print("Absolute Mean Error:",metrics.mean_absolute_error(Y,y_pred))
print('Root Mean Squared Error:',np.sqrt(metrics.mean_squared_error(Y,y_pred)))

Absolute Mean Error: 0.07551548971034726
Root Mean Squared Error: 0.10608511146333924

In [13]:
# Now observe the difference between Output Y and Predicted y1
y1=pd.Series(y_pred)
print(Y)
print(y1)

0    30
1    20
2    40
3    60
4    50
5    70
6    76
7    50
8    90
Name: Salary(in K), dtype: int64
0    29.974750
1    20.001207
2    40.008010
3    60.196896
4    49.850801
5    69.981510
6    75.853936
7    50.133707
8    89.999184
dtype: float64